from banglakit.generator import generate


def test_at_rule():
    'কাট, ছাট'
    assert generate('কাট') == {'কাটব', 'কেটেছেন', 'কেটেছিস', 'কাটতেন', 'কেটেছিলে', 'কাটছ', 'কাটতাম', 'কাটছি', 'কাটবেন',
                               'কেটেছে', 'কাটল', 'কেটেছিলাম', 'কাটছিলে', 'কেটেছি', 'কাটতি', 'কেটেছ', 'কাটলাম', 'কাট',
                               'কাটছিলাম', 'কেটেছিলেন', 'কাটছিলেন', 'কেটেছিলি', 'কাটতে', 'কাটিস', 'কাটি', 'কাটবি',
                               'কাটলে', 'কেটেছিল', 'কাটলি', 'কাটেন', 'কাটছিল', 'কাটছেন', 'কাটলেন', 'কাটবে', 'কাটছিস',
                               'কাটত', 'কাটছিলি', 'কাটছে', 'কাটে'}
