from banglakit.generator import rule_1


def test_at_rule():
    # 'কাট, ছাট'
    assert rule_1('কাট', 'কাট') == {'কেটেছিলাম': 'কাট', 'কাটছ': 'কাট', 'কেটেছিল': 'কাট', 'কাটলেন': 'কাট',
                                    'কেটেছিলি': 'কাট', 'কাটলে': 'কাট', 'কাটবে': 'কাট', 'কাটিস': 'কাট', 'কাট': 'কাট',
                                    'কাটে': 'কাট', 'কেটেছিলে': 'কাট', 'কাটবি': 'কাট', 'কাটতি': 'কাট', 'কাটছিলে': 'কাট',
                                    'কাটলি': 'কাট', 'কাটছিস': 'কাট', 'কেটেছি': 'কাট', 'কাটছিলেন': 'কাট', 'কাটেন': 'কাট',
                                    'কাটতে': 'কাট', 'কেটেছেন': 'কাট', 'কেটেছ': 'কাট', 'কেটেছিলেন': 'কাট', 'কাটি': 'কাট',
                                    'কেটেছে': 'কাট', 'কাটলাম': 'কাট', 'কাটতেন': 'কাট', 'কাটছে': 'কাট', 'কাটছিল': 'কাট',
                                    'কাটতাম': 'কাট', 'কাটছিলি': 'কাট', 'কাটছিলাম': 'কাট', 'কাটছেন': 'কাট',
                                    'কাটল': 'কাট', 'কাটত': 'কাট', 'কাটব': 'কাট', 'কাটবেন': 'কাট', 'কাটছি': 'কাট',
                                    'কেটেছিস': 'কাট'}
